; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	image2 - mode
	image0 - mode
	thermograph1 - mode
	infrared3 - mode
	Star3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon15)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image2)
	(supports instrument4 image0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
)
(:goal (and
	(pointing satellite0 Star12)
	(pointing satellite2 GroundStation1)
	(have_image Phenomenon5 thermograph1)
	(have_image Phenomenon6 thermograph1)
	(have_image Planet7 image2)
	(have_image Star8 image0)
	(have_image Phenomenon9 thermograph1)
	(have_image Star10 infrared3)
	(have_image Phenomenon11 image0)
	(have_image Star12 image2)
	(have_image Star13 infrared3)
	(have_image Star14 image0)
	(have_image Phenomenon15 image0)
	(have_image Star16 image2)
))

)

; plan
1. (turn_to satellite2 groundstation2 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 14
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 14
3. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 0 of 14
4. (turn_to satellite2 phenomenon9 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 14
5. (take_image satellite2 phenomenon9 instrument5 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 1 of 14
6. (turn_to satellite2 phenomenon6 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 14
7. (take_image satellite2 phenomenon6 instrument5 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 2 of 14
8. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   goals met: 2 of 14
9. (take_image satellite2 phenomenon5 instrument5 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 3 of 14
10. (turn_to satellite2 groundstation1 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 groundstation1)
   goals met: 4 of 14
11. (turn_to satellite0 groundstation1 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 14
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 14
13. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 4 of 14
14. (turn_to satellite0 phenomenon11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 14
15. (take_image satellite0 phenomenon11 instrument2 image0)
   added: (have_image phenomenon11 image0)
   goals met: 5 of 14
16. (turn_to satellite0 phenomenon15 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 14
17. (take_image satellite0 phenomenon15 instrument2 image0)
   added: (have_image phenomenon15 image0)
   goals met: 6 of 14
18. (turn_to satellite0 planet7 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet7)
   goals met: 6 of 14
19. (take_image satellite0 planet7 instrument2 image2)
   added: (have_image planet7 image2)
   goals met: 7 of 14
20. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 7 of 14
21. (take_image satellite0 star10 instrument2 infrared3)
   added: (have_image star10 infrared3)
   goals met: 8 of 14
22. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 8 of 14
23. (take_image satellite0 star13 instrument2 infrared3)
   added: (have_image star13 infrared3)
   goals met: 9 of 14
24. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 9 of 14
25. (take_image satellite0 star14 instrument2 image0)
   added: (have_image star14 image0)
   goals met: 10 of 14
26. (turn_to satellite0 star16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star16)
   goals met: 10 of 14
27. (take_image satellite0 star16 instrument2 image2)
   added: (have_image star16 image2)
   goals met: 11 of 14
28. (turn_to satellite0 star8 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star8)
   goals met: 11 of 14
29. (take_image satellite0 star8 instrument2 image0)
   added: (have_image star8 image0)
   goals met: 12 of 14
30. (turn_to satellite0 star12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star12)
   goals met: 13 of 14
31. (take_image satellite0 star12 instrument2 image2)
   added: (have_image star12 image2)
   goals met: 14 of 14
